/*Григор Димитров е тенисист, чиято следваща цел е изкачването в световната ранглиста по тенис за мъже. 
През годината Гришо участва в определен брой турнири, като за всеки турнир получава точки, които зависят от позицията, на която е завършил в турнира. Има три варианта за завършване на турнир:
	W - ако е победител получава 2000 точки
	F - ако е финалист получава 1200 точки
	SF - ако е полуфиналист получава 720 точки
Напишете програма, която изчислява колко ще са точките на Григор след изиграване на всички турнири, като знаете с колко точки стартира сезона. Също изчислете колко точки средно печели от всички изиграни турнири и колко процента от турнирите е спечелил. 
Вход
От конзолата първо се четат два реда:
•	Брой турнири, в които е участвал – цяло число в интервала [1…20] 
•	Начален брой точки в ранглистата - цяло число в интервала [1...4000]
За всеки турнир се прочита отделен ред:
•	Достигнат етап от турнира – текст – "W", "F" или "SF"
Изход
Отпечатват се три реда в следния формат:
•	"Final points: {брой точки след изиграните турнири}"
•	"Average points: {средно колко точки печели за турнир}"
•	"{процент спечелени турнири}%"
Средните точки да бъдат закръглени към най-близкото цяло число надолу, а процентът да се форматира до втората цифра след десетичния знак.
 */

function tennisRanklist(input){
    let tournamentsCount=Number(input[0]);
    let initialPoints=Number(input[1]);

    let pointsWon=0;
    let winsCount=0;

    for(let i=2;i<tournamentsCount+2;i++){
        let result=input[i];

        if(result==='W'){
            pointsWon+=2000;
            winsCount++;
        }else if(result==='F'){
            pointsWon+=1200;
        }else if(result==='SF'){
            pointsWon+=720;
        }
    }

    let totalPoints=initialPoints+pointsWon;
    console.log(`Final points: ${totalPoints}`);

    let avgPoints=Math.floor(pointsWon/tournamentsCount);
    console.log(`Average points: ${avgPoints}`);

    let percentWon=(winsCount/tournamentsCount)*100;
    console.log(`${percentWon.toFixed(2)}%`);
}
tennisRanklist(["5","1400","F","SF","W","W","SF"]);
