/* Най-малкият син на семейство Иванови все още не знае таблицата за умножение. Веднага след коледните празници, той ще има контролно и вие трябва да му помогнете да я научи. Вашата задача е да съставите програма, в която се въвежда цяло трицифрено число и се извежда таблицата за умножение. Поради особености на Вашата програма, тя взима цифрите на въведеното число в обратен ред. Максималната стойност на множителите е определена от всяка една от 3-те цифри на въведеното число.
Вход
Входът е цяло трицифрено число в интервала [111…999].
Изход
Да се отпечатат на конзолата няколко на брой реда в следния формат:
"{първата цифра} * {втората цифра} * {третата цифра} = {резултатът от умножението на трите цифри};"
Първата, втората и третата цифра не могат да бъдат отрицателни числа или равни на 0!
*/
function multiplyTable(input) {
    let number = Number(input[0]);

    let firstDigit = number % 10;
    let secondDigit = Math.floor((number / 10) % 10);
    let thirdDigit = Math.floor(number / 100);

    for (let first = 1; first <= firstDigit; first++) {
        for (let second = 1; second <= secondDigit; second++) {
            for (let third = 1; third <= thirdDigit; third++) {
                let result = first * second * third;
                console.log(`${first} * ${second} * ${third} = ${result};`);
            }
        }
    }
}
multiplyTable(["324"]);