// Напишете функция за конвертиране на щатски долари (USD) в български лева (BGN). Използвайте фиксиран курс между долар и лев: 1 USD = 1.79549 BGN.
function convertor(input){
    let usd=Number(input[0]);
    let bgn=usd*1.79549;
    console.log(bgn);
}
convertor(["22"]);

//Напишете програма, която чете ъгъл в радиани (десетично число) и го преобразува в градуси. Използвайте формулата: градус = радиан * 180 / π. Числото π в Java програми е достъпно чрез Math.PI.
function radiansToDegrees(input){
    let radians=Number(input[0]);
    let degrees=radians*180/Math.PI;
    console.log(degrees);
}
radiansToDegrees(["3.1416"]);

//Напишете програма, която изчислява каква сума ще получите в края на депозитния период при определен лихвен процент. Използвайте следната формула: 
//сума = депозирана сума  + срок на депозита * ((депозирана сума * годишен лихвен процент ) / 12)
// Вход
// От конзолата се четат 3 реда:
// 1.	Депозирана сума – реално число в интервала [100.00 … 10000.00]
// 2.	Срок на депозита (в месеци) – цяло число в интервала [1…12]
// 3.	Годишен лихвен процент – реално число в интервала [0.00 …100.00]
// Изход
// Да се отпечата на конзолата сумата в края на срока.

function depositCalculator(input){
    let depositedSum=Number(input[0]);
    let depositPeriod=Number(input[1]);
    let annualInterestPercent=Number(input[2]);

    let annualInterestDecimal=annualInterestPercent/100;

    let sum=depositedSum+depositPeriod*((depositedSum*annualInterestDecimal)/12);
    console.log(sum);
}
depositCalculator(["200 ", "3 ", "5.7 "]);


// За лятната ваканция в списъка със задължителна литература на Жоро има определен брой книги. Понеже Жоро предпочита да играе с приятели навън, вашата задача е да му помогнете да изчисли колко часа на ден трябва да отделя, за да прочете необходимата литература.
// Вход
// От конзолата се четат 3 реда:
// 1.	Брой страници в текущата книга – цяло число в интервала [1…1000]
// 2.	Страници, които прочита за 1 час – цяло число в интервала [1…1000]
// 3.	Броят на дните, за които трябва да прочете книгата – цяло число в интервала [1…1000]
// Изход
// Да се отпечата на конзолата броят часове, които Жоро трябва да отделя за четене всеки ден.

function vacationBooksList(input){
    let numberOfPages=input[0];
    let pagesPerHour=input[1];
    let numberOfDays=input[2];

    let totalTime=numberOfPages/pagesPerHour;
    let totalHoursPerDay=totalTime/numberOfDays;
    
    console.log(totalHoursPerDay);
}
vacationBooksList(["212 ","20 ","2 "]);


// Учебната година вече е започнала и отговорничката на 10Б клас - Ани трябва да купи определен брой пакетчета с химикали, пакетчета с маркери, както и препарат за почистване на дъска. Тя е редовна клиентка на една книжарница, затова има намаление за нея, което представлява някакъв процент от общата сума. Напишете програма, която изчислява колко пари ще трябва да събере Ани, за да плати сметката, като имате предвид следния ценоразпис: 
// •	Пакет химикали - 5.80 лв. 
// •	Пакет маркери - 7.20 лв. 
// •	Препарат - 1.20 лв (за литър)
// Вход
// От конзолата се четат 4 числа:
// •	Брой пакети химикали - цяло число в интервала [0...100]
// •	Брой пакети маркери - цяло число в интервала [0...100]
// •	Литри препарат за почистване на дъска - цяло число в интервала [0…50]
// •	Процент намаление - цяло число в интервала [0...100]
// Изход
// Да се отпечата на конзолата колко пари ще са нужни на Ани, за да си плати сметката.

function suppliesforSchool(input){
    let numberPens=input[0];
    let numberMarkers=input[1];
    let literCleaner=input[2];
    let percentDiscount=input[3];

    pricePens=numberPens*5.80;
    priceMarkers=numberMarkers*7.20;
    priceCleaner=literCleaner*1.20;
    totalPrice=priceCleaner+priceMarkers+pricePens;
    totalPriceWithDiscount=totalPrice-(totalPrice*(percentDiscount/100));

    console.log(totalPriceWithDiscount);

}
suppliesforSchool(["2 ","3 ","4 ","25 "]);


// Румен иска да пребоядиса хола и за целта е наел майстори. Напишете програма, която изчислява разходите за ремонта, предвид следните цени:
// •	Предпазен найлон - 1.50 лв. за кв. метър
// •	Боя - 14.50 лв. за литър
// •	Разредител за боя - 5.00 лв. за литър
// За всеки случай, към необходимите материали, Румен иска да добави още 10% от количеството боя и 2 кв.м. найлон, разбира се и 0.40 лв. за торбички. Сумата, която се заплаща на майсторите за 1 час работа, е равна на 30% от сбора на всички разходи за материали.
// Вход
// Входът се чете от конзолата и съдържа точно 4 реда:
// 1.	Необходимо количество найлон (в кв.м.) - цяло число в интервала [1... 100]
// 2.	Необходимо количество боя (в литри) - цяло число в интервала [1…100]
// 3.	Количество разредител (в литри) - цяло число в интервала [1…30]
// 4.	Часовете, за които майсторите ще свършат работата - цяло число в интервала [1…9]
// Изход
// Да се отпечата на конзолата един ред:
// •	"{сумата на всички разходи}"

function repainting(input){

    let nylonQuantity=Number(input[0]);
    let paintQuantity=Number(input[1]);
    let thinnerQuantity=Number(input[2]);
    let workHours=Number(input[3]);

    let additionalPaintQuantity = 0.1 * paintQuantity;
    let additionalNylon=2;
    let bags=0.40;
    
    let sumNylon=(nylonQuantity+additionalNylon)*1.50;
    let sumPaint=(paintQuantity+additionalPaintQuantity)*14.50;
    let sumThinner=thinnerQuantity*5;

    let totalMaterialsPrice=sumNylon+sumPaint+sumThinner+bags;
    let workersSumPerHour=0.30*totalMaterialsPrice;
    let totalWorkersSum=workHours*workersSumPerHour;

    let finalPrice=totalMaterialsPrice+totalWorkersSum;
    console.log(finalPrice);

}
repainting(["5 ","10 ","10 ","1 "]);



// Ресторант отваря врати и предлага няколко менюта на преференциални цени: 
// •	Пилешко меню –  10.35 лв. 
// •	Меню с риба – 12.40 лв. 
// •	Вегетарианско меню  – 8.15 лв. 
// Напишете програма, която изчислява колко ще струва на група хора да си поръчат храна за вкъщи.
// Групата ще си поръча и десерт, чиято цена е равна на 20% от общата сметка (без доставката). 
// Цената на доставка е 2.50 лв и се начислява най-накрая.  
// Вход
// От конзолата се четат 3 реда:
// •	Брой пилешки менюта – цяло число в интервала [0 … 99]
// •	Брой менюта с риба – цяло число в интервала [0 … 99]
// •	Брой вегетариански менюта – цяло число в интервала [0 … 99]
// Изход
// Да се отпечата на конзолата един ред:  "{цена на поръчката}"

function foodDelivery(input){
    let chickenQ=Number(input[0]);
    let fishQ=Number(input[1]);
    let vegQ=Number(input[2]);

    let totalChickenPrice=chickenQ*10.35;
    let totalFishPrice=fishQ*12.40;
    let totalVegPrice=vegQ*8.15;

    let total=totalChickenPrice+totalFishPrice+totalVegPrice;
    let dessert=total*0.20;
    let delivery=2.50;

    let finalPriceDelivery=total+dessert+delivery;
    console.log(finalPriceDelivery);
}
foodDelivery(["2 ","4 ","3 "]);

// Джеси решава, че иска да се занимава с баскетбол, но за да тренира е нужна екипировка. Напишете програма, която изчислява какви разходи ще има Джеси, ако започне да тренира, като знаете колко е таксата за тренировки по баскетбол за период от 1 година. Нужна екипировка: 
// •	Баскетболни кецове – цената им е 40% по-малка от таксата за една година
// •	Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
// •	Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
// •	Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка
// Вход
// От конзолата се четe 1 ред:
// •	Годишната такса за тренировки по баскетбол – цяло число в интервала [0… 9999]
// Изход
// Да се отпечата на конзолата колко ще са разходите на Джеси, ако започне да спортува баскетбол.

function basketballEquipment(input){
    let yearPrice=Number(input[0]);

    let shoes=yearPrice-(yearPrice*0.40);
    let equipment=shoes-(shoes*0.20);
    let ball=(1/4)*equipment;
    let accessories=(1/5)*ball;

    let total=yearPrice+shoes+equipment+ball+accessories;
    console.log(total);
}
basketballEquipment(["365 "]);


// За рождения си ден Любомир получил аквариум с формата на паралелепипед. Първоначално прочитаме от конзолата на отделни редове размерите му – дължина, широчина и височина в сантиметри. Трябва да се пресметне колко литра вода ще събира аквариума, ако се знае, че определен процент от вместимостта му е заета от пясък, растения, нагревател и помпа. 
// Един литър вода се равнява на един кубичен дециметър/ 1л=1 дм3/. 
// Да се напише програма, която изчислява литрите вода, която са необходими за напълването на аквариума.
// Вход
// От конзолата се четат 4 реда:
// 1.	Дължина в см – цяло число в интервала [10 … 500]
// 2.	Широчина в см – цяло число в интервала [10 … 300]
// 3.	Височина в см – цяло число в интервала [10… 200]
// 4.	Процент  – реално число в интервала [0.000 … 100.000]
// Изход
// Да се отпечата на конзолата едно число:
// •	литрите вода, които ще събира аквариума.

function fishTank(input){
    let lenghtSm=Number(input[0]);
    let widthSm=Number(input[1]);
    let hightSm=Number(input[2]);
    let percentage=Number(input[3]);

    let V=lenghtSm*widthSm*hightSm;
    let vLitters=V/1000;
    let space=percentage/100;
    let neededLitters=vLitters*(1-space);

    console.log(neededLitters);
}
fishTank(["85 ","75 ","47 ","17 "]);